import pandas as pd
данные = {
 'ОБЗР' : [5, 4, 4],
 'Вероятность_и_Статистика' : [5, 4, 3],
 'География' : [4, 5, 4],
 'Труд' : [4, 4, 4],
 'Черчение' : [4, 4, 4],
 'Биология' : [4, 4, 5],
 'Русский_язык' : [4, 4, 4],
 'Литература' : [5, 4, 5],
 'Англиский_язык' : [5, 4, 5],
 'Физика' : [4, 5, 4],
 'Алгебра' : [5, 4, 5],
 'Геометрия' : [3, 5, 4],
 'Химия' : [4, 4, 4],
 'Обществознание' : [4, 5, 4],
 'Информатика' : [5, 4, 5],
 'Физкультура' : [4, 3, 5],
 'История' : [5, 5, 5]
}
df = pd.DataFrame(данные)
df.to_csv('оценки.csv', index=False, encoding='utf-8')