import pandas as pd
данные = {
'ОБЗР' : [54],
'Вероятность_и_Статистика' : [543],
'География' : [4543],
'Труд' : [444],
'Черчение' : [444],
'Биология' : [4455544],
'Русский_язык' : [444444],
'Литература' : [54535],
'Англиский_язык' : [5455555454],
'Физика' : [4545333323],
'Алгебра' : [54542],
'Геометрия' : [3545],
'Химия' : [444],
'Обществознание' : [4542],
'Информатика' : [54],
'Физкультура' : [43554544],
'История' : [55545]
}
df = pd.DataFrame(данные)
df.to_csv('оценки.csv', index=False, encoding='utf-8')